src/DataProcessors/GenerateStatements.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>GenerateStatements</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Documents/Statement.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>Statement</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BeginOfPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/GenerateStatements/Forms/Form/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	CurrentDate = CurrentSessionDate();
	
	BeginOfPeriod = BegOfMonth(AddMonth(CurrentDate, -1)); 
	EndOfPeriod = EndOfMonth(AddMonth(CurrentDate, -1)); 
	
	AmountRCBalance = 0.01;
	
	Items.Result.Visible = False;
	
EndProcedure

&AtClient
Procedure ShowList(Command)
	
	ShowListAtServer();
	
	Items.Result.Visible = True;
	
EndProcedure

&AtServer
Procedure ShowListAtServer()
	
	Query = New Query;
	Query.Text = "SELECT
	             |	TRUE AS Choice,
	             |	Companies.Ref AS Company,
	             |	ISNULL(GeneralJournalBalance.AmountRCBalance, 0) AS AmountRCBalance
	             |FROM
	             |	Catalog.Companies AS Companies
	             |		LEFT JOIN AccountingRegister.GeneralJournal.Balance(&EndOfPeriod, , , ExtDimension1.Customer = TRUE) AS GeneralJournalBalance
	             |		ON Companies.Ref = GeneralJournalBalance.ExtDimension1
	             |WHERE
	             |	ISNULL(GeneralJournalBalance.AmountRCBalance, 0) >= &AmountRCBalance
	             |	AND Companies.Customer = TRUE";
				 
	Query.SetParameter("EndOfPeriod", EndOfDay(EndOfPeriod));
	Query.SetParameter("AmountRCBalance", AmountRCBalance);
	
	ValueToFormData(Query.Execute().Unload(), List);
	
EndProcedure

&AtClient
Procedure SelectAllCompanies(Command)
	
	For Each Line In List Do
		Line.Choice = True;	
	EndDo;
	
EndProcedure

&AtClient
Procedure ClearAllCompanies(Command)
	
	For Each Line In List Do
		Line.Choice = False;	
	EndDo;
	
EndProcedure

&AtClient
Procedure GenerateStatements(Command)
	
	GenerateStatementsAtServer();
	
	Notify("UpdateStatements");
	
	ThisForm.Close();
	
EndProcedure

&AtServer
Procedure GenerateStatementsAtServer()
	
	For Each Line In List Do
		
		If Line.Choice Then
			
			DocObject = Documents.Statement.CreateDocument();
			
			DocObject.Date = EndOfPeriod;
			DocObject.BeginOfPeriod = BeginOfPeriod;
			DocObject.Company = Line.Company;
			
			DocObject.Write();
			
		EndIf;
		
	EndDo;
	
EndProcedure
